experiments/workflow/beldi-hotel/expected_results/qps300/wrk.log
Running 2m test @ http://ip-172-31-12-27.us-east-2.compute.internal:8080
  2 threads and 2 connections
  Thread calibration: mean lat.: 3.723ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 4.487ms, rate sampling interval: 33ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.56ms    9.91ms  46.56ms   87.87%
    Req/Sec   153.89     77.81   526.00     79.41%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.90ms
 75.000%    1.19ms
 90.000%   16.67ms
 99.000%   42.56ms
 99.900%   42.62ms
 99.990%   42.65ms
 99.999%   46.59ms
100.000%   46.59ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.225     0.000000            1         1.00
       0.406     0.100000         4222         1.11
       0.535     0.200000         8406         1.25
       0.657     0.300000        12615         1.43
       0.773     0.400000        16824         1.67
       0.902     0.500000        21020         2.00
       0.963     0.550000        23139         2.22
       1.018     0.600000        25223         2.50
       1.070     0.650000        27332         2.86
       1.125     0.700000        29436         3.33
       1.191     0.750000        31504         4.00
       1.223     0.775000        32571         4.44
       1.252     0.800000        33624         5.00
       1.305     0.825000        34651         5.71
       3.609     0.850000        35699         6.67
      10.143     0.875000        36751         8.00
      16.399     0.887500        37288         8.89
      16.671     0.900000        37818        10.00
      22.927     0.912500        38344        11.43
      23.183     0.925000        38861        13.33
      29.439     0.937500        39390        16.00
      29.583     0.943750        39675        17.78
      29.695     0.950000        39919        20.00
      35.871     0.956250        40224        22.86
      35.967     0.962500        40499        26.67
      36.095     0.968750        40695        32.00
      36.159     0.971875        40869        35.56
      36.191     0.975000        40953        40.00
      42.335     0.978125        41183        45.71
      42.367     0.981250        41395        53.33
      42.367     0.984375        41395        64.00
      42.399     0.985938        41530        71.11
      42.399     0.987500        41530        80.00
      42.559     0.989062        41603        91.43
      42.591     0.990625        41836       106.67
      42.591     0.992188        41836       128.00
      42.591     0.992969        41836       142.22
      42.591     0.993750        41836       160.00
      42.591     0.994531        41836       182.86
      42.591     0.995313        41836       213.33
      42.591     0.996094        41836       256.00
      42.623     0.996484        41987       284.44
      42.623     0.996875        41987       320.00
      42.623     0.997266        41987       365.71
      42.623     0.997656        41987       426.67
      42.623     0.998047        41987       512.00
      42.623     0.998242        41987       568.89
      42.623     0.998437        41987       640.00
      42.623     0.998633        41987       731.43
      42.623     0.998828        41987       853.33
      42.623     0.999023        41987      1024.00
      42.623     0.999121        41987      1137.78
      42.623     0.999219        41987      1280.00
      42.623     0.999316        41987      1462.86
      42.623     0.999414        41987      1706.67
      42.623     0.999512        41987      2048.00
      42.623     0.999561        41987      2275.56
      42.623     0.999609        41987      2560.00
      42.623     0.999658        41987      2925.71
      42.623     0.999707        41987      3413.33
      42.655     0.999756        41994      4096.00
      42.655     0.999780        41994      4551.11
      42.655     0.999805        41994      5120.00
      42.655     0.999829        41994      5851.43
      42.655     0.999854        41994      6826.67
      42.655     0.999878        41994      8192.00
      42.655     0.999890        41994      9102.22
      42.655     0.999902        41994     10240.00
      46.367     0.999915        41996     11702.86
      46.367     0.999927        41996     13653.33
      46.367     0.999939        41996     16384.00
      46.367     0.999945        41996     18204.44
      46.367     0.999951        41996     20480.00
      46.399     0.999957        41997     23405.71
      46.399     0.999963        41997     27306.67
      46.399     0.999969        41997     32768.00
      46.399     0.999973        41997     36408.89
      46.399     0.999976        41997     40960.00
      46.591     0.999979        41998     46811.43
      46.591     1.000000        41998          inf
#[Mean    =        4.560, StdDeviation   =        9.913]
#[Max     =       46.560, Total count    =        41998]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%  189.00us
 75.000%  210.00us
 90.000%  229.00us
 99.000%   41.95ms
 99.900%   42.01ms
 99.990%   42.08ms
 99.999%   45.95ms
100.000%   45.95ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.122     0.000000            1         1.00
       0.153     0.100000         4250         1.11
       0.167     0.200000         8543         1.25
       0.175     0.300000        12747         1.43
       0.182     0.400000        16956         1.67
       0.189     0.500000        21249         2.00
       0.193     0.550000        23625         2.22
       0.196     0.600000        25225         2.50
       0.200     0.650000        27324         2.86
       0.205     0.700000        29719         3.33
       0.210     0.750000        31845         4.00
       0.212     0.775000        32648         4.44
       0.215     0.800000        33740         5.00
       0.218     0.825000        34774         5.71
       0.221     0.850000        35770         6.67
       0.225     0.875000        36883         8.00
       0.227     0.887500        37392         8.89
       0.229     0.900000        37850        10.00
       0.232     0.912500        38419        11.43
       0.235     0.925000        38898        13.33
       0.239     0.937500        39446        16.00
       0.241     0.943750        39682        17.78
       0.244     0.950000        39953        20.00
       0.247     0.956250        40180        22.86
       0.252     0.962500        40454        26.67
       0.258     0.968750        40688        32.00
       0.265     0.971875        40824        35.56
       0.283     0.975000        40952        40.00
      41.887     0.978125        41185        45.71
      41.919     0.981250        41401        53.33
      41.919     0.984375        41401        64.00
      41.951     0.985938        41637        71.11
      41.951     0.987500        41637        80.00
      41.951     0.989062        41637        91.43
      41.951     0.990625        41637       106.67
      41.983     0.992188        41791       128.00
      41.983     0.992969        41791       142.22
      41.983     0.993750        41791       160.00
      41.983     0.994531        41791       182.86
      42.015     0.995313        41962       213.33
      42.015     0.996094        41962       256.00
      42.015     0.996484        41962       284.44
      42.015     0.996875        41962       320.00
      42.015     0.997266        41962       365.71
      42.015     0.997656        41962       426.67
      42.015     0.998047        41962       512.00
      42.015     0.998242        41962       568.89
      42.015     0.998437        41962       640.00
      42.015     0.998633        41962       731.43
      42.015     0.998828        41962       853.33
      42.015     0.999023        41962      1024.00
      42.015     0.999121        41962      1137.78
      42.047     0.999219        41989      1280.00
      42.047     0.999316        41989      1462.86
      42.047     0.999414        41989      1706.67
      42.047     0.999512        41989      2048.00
      42.047     0.999561        41989      2275.56
      42.047     0.999609        41989      2560.00
      42.047     0.999658        41989      2925.71
      42.047     0.999707        41989      3413.33
      42.047     0.999756        41989      4096.00
      42.047     0.999780        41989      4551.11
      42.079     0.999805        41994      5120.00
      42.079     0.999829        41994      5851.43
      42.079     0.999854        41994      6826.67
      42.079     0.999878        41994      8192.00
      42.079     0.999890        41994      9102.22
      42.079     0.999902        41994     10240.00
      45.887     0.999915        41995     11702.86
      45.887     0.999927        41995     13653.33
      45.919     0.999939        41997     16384.00
      45.919     0.999945        41997     18204.44
      45.919     0.999951        41997     20480.00
      45.919     0.999957        41997     23405.71
      45.919     0.999963        41997     27306.67
      45.919     0.999969        41997     32768.00
      45.919     0.999973        41997     36408.89
      45.919     0.999976        41997     40960.00
      45.951     0.999979        41998     46811.43
      45.951     1.000000        41998          inf
#[Mean    =        1.203, StdDeviation   =        6.425]
#[Max     =       45.920, Total count    =        41998]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  45002 requests in 2.50m, 7.00MB read
Requests/sec:    300.01
Transfer/sec:     47.76KB